.emacs.d/emacs_settings.org
#+TITLE: Emacs settings
#+AUTHOR: Carlos Alberto Rivera 
#+EMAIL: cantorlunae@gmail.com
#+STARTUP: indent hidestars overview
* Remember
** remember that <s + tab creates a code block for adding more entries. remember to add to it "emacs-lisp"
** remember the location for hunspell dictionaries should be in /usr/share/hunspell
* Repositories 
#+BEGIN_SRC emacs-lisp
(require 'package)
(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/") 
                         ("org" . "http://orgmode.org/elpa/")))
#+END_SRC
* Initialization
** Error with package signatures
#+BEGIN_SRC emacs-lisp
;;(setq package-check-signature nil)
#+END_SRC
** Workspace settings 
#+BEGIN_SRC emacs-lisp
       (tool-bar-mode -1) ; introduced in emacs 21
       (menu-bar-mode -1)
       (scroll-bar-mode -1)
       (menu-bar-showhide-fringe-menu-customize-disable)
       (setq-default fill-column 70)
       (setq mode-line-format nil)
       (setq inhibit-splash-screen t)
       (setq left-margin-width 26)
       (setq right-margin-width 26)
       (add-to-list 'default-frame-alist '(fullscreen . maximized))
       ;; (add-hook 'emacs-startup-hook 'toggle-frame-maximized)
#+END_SRC
** Workspace keybindgs
#+BEGIN_SRC emacs-lisp
(defun toggle-mode-line () "toggles the modeline on and off"
  (interactive) 
  (setq mode-line-format
    (if (equal mode-line-format nil)
        (default-value 'mode-line-format)) )
  (redraw-display))

(global-set-key [C-f11] 'toggle-mode-line)
(global-set-key (kbd "<f8>") 'tool-bar-mode)
(global-set-key (kbd "<f9>") 'menu-bar-mode)
#+END_SRC
** Bookmarks directory
#+BEGIN_SRC emacs-lisp
(setq bookmark-default-file (concat user-emacs-directory "bookmarks")
      bookmark-save-flag 1)
#+END_SRC
** Autosave
#+BEGIN_SRC emacs-lisp
(setq auto-save-interval 100
         auto-save-timeout 60)
#+END_SRC
** CUSTOM directory
#+BEGIN_SRC emacs-lisp
(setq custom-file (expand-file-name "custom_settings.el" user-emacs-directory))
(load custom-file)
#+END_SRC
** Text settings
*** Different faces for different buffers
**** Monospaced faces 
#+BEGIN_SRC emacs-lisp
;; define default faces
(set-face-attribute 'default nil :font "Fira Mono")
(set-face-attribute 'default nil :height 130)

 (defun my-buffer-face-mode-fixed ()
   "Sets a fixed width (monospace) font in current buffer"
   (interactive)
   (setq buffer-face-mode-face '(:family "Fira Mono" :height 130 :spacing monospace))
   (buffer-face-mode))
#+END_SRC
**** Variable-width faces 
#+BEGIN_SRC emacs-lisp
 (defun my-buffer-face-mode-variable ()
   "Set font to a variable width (proportional) fonts in current buffer"
   (interactive)
   (setq buffer-face-mode-face '(:family "Linux Libertine Display" :height 160 :width expanded))
   (buffer-face-mode))
#+END_SRC
**** Set default font faces for Info, ERC, and Org
#+BEGIN_SRC emacs-lisp
 (add-hook 'erc-mode-hook 'my-buffer-face-mode-variable)
 (add-hook 'Info-mode-hook 'my-buffer-face-mode-variable)
 (add-hook 'org-mode-hook 'my-buffer-face-mode-variable)
#+END_SRC
*** No tabs, only spaces
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
#+END_SRC
*** Allow narrowing
#+BEGIN_SRC emacs-lisp
(put 'narrow-to-region 'disabled nil)
#+END_SRC
*** Dealing with whitespace
#+BEGIN_SRC emacs-lisp
(defun buffer-cleanup ()
  "Clean up the buffer"
  (interactive)
  (delete-blank-lines)
  (delete-trailing-whitespace)
  (untabify (point-min) (point-max))
  (indent-region (point-min) (point-max)))

(global-set-key (kbd "C-c n") 'buffer-cleanup)
#+END_SRC
** List of recent files
#+BEGIN_SRC emacs-lisp
(require 'recentf)
(setq recentf-max-saved-items 25
      recentf-max-menu-items 25)
(recentf-mode +1)

(global-set-key (kbd "<f5>") 'recentf-open-files)
#+END_SRC
** Margins to buffer
#+BEGIN_SRC emacs-lisp
;; setting margins at start up
;;(setq left-margin-width 26)
;;(setq right-margin-width 26)

;; margins function
(defun my-toggle-margins ()
"Set margins in current buffer."
(interactive)
  (if (or (> left-margin-width 0) (> right-margin-width 0))
    (progn
      (setq left-margin-width 0)
      (setq right-margin-width 0)
      (set-window-buffer (selected-window) (current-buffer)))
    (setq left-margin-width 26)
    (setq right-margin-width 26)
    (set-window-buffer (selected-window) (current-buffer))))

;; set key binding
(global-set-key [C-f9] 'my-toggle-margins)
#+END_SRC
** Solarized theme
#+BEGIN_SRC emacs-lisp
;;(add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
(add-to-list 'custom-theme-load-path "/home/sync0/.emacs.d/elpa/")
;; Don't change size of org-mode headlines (but keep other size-changes)
(setq solarized-scale-org-headlines nil)
;; Don't change the font for some headings and titles
(setq solarized-use-variable-pitch nil)

;; load light theme
;;(load-theme 'solarized-light t)

;; load dark theme
(load-theme 'solarized-dark t)
#+END_SRC
** Force UTF-8 encoding
#+BEGIN_SRC emacs-lisp
;; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
;; (setq utf-translate-cjk-mode nil)
(set-language-environment 'utf-8)
;; backwards compatibility as default-buffer-file-coding-system
;; is deprecated in 23.2.
;; (if (boundp buffer-file-coding-system)
;;    (setq buffer-file-coding-system 'utf-8)
;; (setq default-buffer-file-coding-system 'utf-8))

;; set the default encoding system
(setq default-file-name-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
(when (display-graphic-p)

;; Treat clipboard input as UTF-8 string first; compound text next, etc.
   (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC
** Remove yes-no EMACS inconsistency
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** Abbrev Mode
#+BEGIN_SRC emacs-lisp
;; avoid expansion character insertion
(defun dont-insert-expansion-char ()  t)    ;; this is the "hook" function
  (put 'dont-insert-expansion-char 'no-self-insert t)   ;; the hook should have a "no-self-insert"-property set 

;; tell emacs where to read abbrev
(setq abbrev-file-name             
        "~/.emacs.d/abbrev_defs")    

;; save abbrevs when files are saved
  (setq save-abbrevs t)              

;; avoid errors when reading abbrev_defs
 (if (file-exists-p abbrev-file-name)
        (quietly-read-abbrev-file))

;; automatically turn on abbrev-mode for the following modes
(dolist (hook '(org-mode-hook
                    emacs-lisp-mode-hook
                    text-mode-hook))
      (add-hook hook (lambda () (abbrev-mode 1))))
#+END_SRC
** Elisp evaluation
#+BEGIN_SRC emacs-lisp
;; (add-hook 'eval-expression-minibuffer-setup-hook #'eldoc-mode)
;; (add-hook 'eval-expression-minibuffer-setup-hook #'paredit-mode)
#+END_SRC 
** Git gutter thingy
#+BEGIN_SRC emacs-lisp
(setq fringes-outside-margins t)
#+END_SRC 
* Packages 
** Ispell - spell checking
*** basic setup
#+BEGIN_SRC emacs-lisp
(cond
  ;; try hunspell at first
  ;; if hunspell does NOT exist, use aspell
 ((executable-find "hunspell")
  (setq ispell-program-name "hunspell")
  (setq ispell-local-dictionary "francais-tex")
  ;;(setq ispell-local-dictionary "en_US")
  (setq ispell-local-dictionary-alist '(  
    (nil "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "american" ) nil utf-8)
    ("english" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "american" ) nil utf-8)
    ("german" "[[:alpha:]ÄÖÜéäöüß]" "[^[:alpha:]ÄÖÜéäöüß]" "[']" t ("-d" "deutsch8") nil utf-8)
    ("spanish" "[[:alpha:]ÁÉÍÓÚÄËÏÖÜÑáéíóúäëïöüñ]" "[^[:alpha:]ÁÉÍÓÚÄËÏÖÜÑáéíóúäëïöüñ]" "[']" t ("-d" "castellano8") nil utf-8)
    ("french" "[[:alpha:]ÀÂÇÈÉÊËÎÏÔÙÛÜàâçèéêëîïôùûü]" "[^[:alpha:]ÀÂÇÈÉÊËÎÏÔÙÛÜàâçèéêëîïôùûü]" "[-']" t ("-d" "francais-tex") nil  utf-8))))

 ((executable-find "aspell")
  (setq ispell-program-name "aspell")
  ;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
  ;;(setq ispell-extra-args '("--sug-mode=ultra"))))
  ;;(setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US"))))
  (setq ispell-extra-args '("--sug-mode=ultra" "--lang=fr_FR"))))

;; check next highlighted word custom function
(defun flyspell-check-next-highlighted-word ()
  "Custom function to spell check next highlighted word"
  (interactive)
  (flyspell-goto-next-error)
  (ispell-word)
  )

;; keybindings
(global-set-key (kbd "<f7>") 'ispell-word)
(global-set-key (kbd "C-S-<f7>") 'flyspell-mode)
(global-set-key (kbd "C-M-<f7>") 'flyspell-buffer)
(global-set-key (kbd "C-<f7>") 'flyspell-check-previous-highlighted-word)
(global-set-key (kbd "M-<f7>") 'flyspell-check-next-highlighted-word)
#+END_SRC
*** ignore tex commands
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (setq ispell-parser 'tex)))
(defun flyspell-ignore-tex ()
  (interactive)
  (set (make-variable-buffer-local 'ispell-parser) 'tex))
(add-hook 'org-mode-hook 'flyspell-ignore-tex)
#+END_SRC
