.emacs.d/emacs_settings.org
*** ignore sections of files for spellcheck
#+BEGIN_SRC emacs-lisp
(add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
(add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
(add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_EXAMPLE" . "#\\+END_EXAMPLE"))
(add-to-list 'ispell-skip-region-alist '("^\\*\sEinstellungen" . "^\\*\\*\sEnde"))
#+END_SRC
** Flyspell
#+BEGIN_SRC emacs-lisp
;;(setq-default flyspell-mode t)
;; better performance
(setq flyspell-issue-message-flag nil)
#+END_SRC
*** Flyspell-lazy
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/flyspell-lazy")
(require 'flyspell-lazy)
(flyspell-lazy-mode 1)
(flyspell-mode 1)      ; or (flyspell-prog-mode)
#+END_SRC 
** Auc-Tex
*** set pdf conversion automatic
#+BEGIN_SRC emacs-lisp
(setq Tex-PDF-mode t)
#+END_SRC
** EVIL mode 
*** initializing
#+BEGIN_SRC emacs-lisp
(require 'evil)
(evil-mode 1)
#+END_SRC
*** Key-chord for fast exit insert mode
#+BEGIN_SRC emacs-lisp
;; (require 'evil-escape)
;; (evil-escape 1)
;; (setq-default evil-escape-key-sequence "fd")
;; (setq-default evil-escape-delay 0.2)

 ;; (require 'key-chord)
 ;;(key-chord-mode 1)
 ;;(key-chord-define evil-insert-state-map  "fd" 'evil-normal-state)
#+END_SRC 
*** input methods 
#+BEGIN_SRC emacs-lisp
  ;; set default input method
  ;; (setq default-input-method "TeX")

  ;; no input method for evil normal state
  (add-hook 'evil-normal-state-entry-hook
    (lambda () (set-input-method 'nil)))

;; Spanish

  ;; spanish-postfix for evil insert mode
  ;;(add-hook 'evil-insert-state-entry-hook
  ;; (lambda () (set-input-method "spanish-postfix")))

  ;; spanish-postfix for evil insert mode
  ;;(add-hook 'evil-insert-state-entry-hook
  ;; (lambda () (set-input-method "spanish-postfix")))

;; Latin

  ;; latin-1-postfix for evil replace mode
  ;;(add-hook 'evil-replace-state-entry-hook
  ;; (lambda () (set-input-method "latin-1-postfix")))

  ;; latin-1-postfix for evil replace mode
  ;;(add-hook 'evil-replace-state-entry-hook
  ;; (lambda () (set-input-method "latin-1-postfix")))

;; French 

  ;; french-postfix for evil insert mode 
(add-hook 'evil-insert-state-entry-hook 
(lambda () (set-input-method "french-postfix")))

  ;; french-postfix for evil replace mode
(add-hook 'evil-replace-state-entry-hook
(lambda () (set-input-method "french-postfix")))

;; German 

  ;; german-postfix for evil insert mode
 ;;(add-hook 'evil-insert-state-entry-hook
 ;;(lambda () (set-input-method "german-postfix")))

  ;; german-postfix for evil replace mode
;;(add-hook 'evil-replace-state-entry-hook
;;(lambda () (set-input-method "german-postfix")))


  ;; (key-chord-define evil-insert-state-map  "fd" 'evil-normal-state)



  ;; (add-hook 'evil-insert-state-entry-hook 'my-french-setup)
  ;; (add-hook 'evil-normal-state-entry-hook 'my-english-setup)
  ;; (add-hook 'evil-replace-state-entry-hook 'my-french-setup)

  ;; (add-hook 'evil-normal-state-entry-hook 'toggle-input-method)
  ;; (add-hook 'evil-insert-state-entry-hook 'toggle-input-method)
  ;; (add-hook 'evil-replace-state-entry-hook 'toggle-input-method)

  ;; keybing
  ;;    (global-set-key (kbd "s-SPC") 'evil-toggle-input-method)
#+END_SRC

(defun my-chinese-setup ()
  "Set up my private Chinese environment."
  (if (equal current-language-environment "Chinese-GB")
      (setq default-input-method "chinese-tonepy")))
(add-hook 'set-language-environment-hook 'my-chinese-setup)

;;  
(defun my-french-setup ()
  "Set up my private Chinese environment."
  (if (equal default-input-method 'nil)
      (setq default-input-method "french-postfix")))

(defun my-english-setup ()
  "Set up my private Chinese environment."
  (if (equal default-input-method "french-postfix")
      (setq default-input-method 'nil)))

;; force EMACS to use a default input method
(defvar use-default-input-method t)
(make-variable-buffer-local 'use-default-input-method)
(defun activate-default-input-method ()
  (interactive)
  (if use-default-input-method
      (activate-input-method default-input-method)
    (inactivate-input-method)))
(add-hook 'after-change-major-mode-hook 'activate-default-input-method)
(add-hook 'minibuffer-setup-hook 'activate-default-input-method)
(defun inactivate-default-input-method ()
  (setq use-default-input-method nil))
(add-hook 'c-mode-hook 'inactivate-default-input-method)

;; make a mode use default input methods by default
(defun activate-default-input-method ()
  (interactive)
  (activate-input-method default-input-method))
  
(add-hook 'org-mode-hook 'activate-default-input-method)
*** EVIL org
**** basic settings
#+BEGIN_SRC emacs-lisp
(defun clever-insert-item ()
  "Clever insertion of org item."
  (if (not (org-in-item-p))
      (insert "\n")
    (org-insert-item))
  )

(defun evil-org-eol-call (fun)
  "Go to end of line and call provided function.
FUN function callback"
  (end-of-line)
  (funcall fun)
  (evil-append nil)
  )
#+END_SRC
**** key bindings
#+BEGIN_SRC emacs-lisp
;; redefinition evils visual mode map
(evil-define-key 'normal org-mode-map
  "<" 'outline-previous-visible-heading
  ">" 'outline-next-visible-heading
  "H" 'org-metaleft
  "L" 'org-metaright
  "J" 'org-metaup
  "K" 'org-metadown
 ;; "K" 'outline-previous-visible-heading
  ;;"J" 'outline-next-visible-heading
 ;; "H" (if (fboundp 'org-backward-same-level)
	;;   'org-backward-same-level
	  ;;'org-backward-heading-same-level)
;;  "L" (if (fboundp 'org-forward-same-level) ;to be backward compatible with older org version
	;;   'org-forward-same-level
	  ;;'org-forward-heading-same-level)
;;  "<" 'org-metaleft
 ;; ">" 'org-metaright
  "k" 'previous-line
  "j" 'next-line
  "m" 'set-mark-command
  "q" 'fill-paragraph
  "o" '(lambda () (interactive) (evil-org-eol-call 'clever-insert-item))
  "O" '(lambda () (interactive) (evil-org-eol-call 'org-insert-heading))
  "$" 'org-end-of-line
  "^" 'org-beginning-of-line
  "[" 'backward-sentence
  "]" 'forward-sentence
  "{" 'org-backward-paragraph
  "}" 'org-forward-paragraph
  "-" 'org-cycle-list-bullet
  (kbd "<tab>") 'org-cycle)

;; redefinition evils visual mode map
;;(evil-define-key 'visual global-map
 ;; "-" '
  ;;(kbd "<tab>") 'org-cycle)
#+END_SRC
*** 待 EVIL org_copy
**** basic settings
(defun clever-insert-item ()
  "Clever insertion of org item."
  (if (not (org-in-item-p))
      (insert "\n")
    (org-insert-item))
  )

(defun evil-org-eol-call (fun)
  "Go to end of line and call provided function.
FUN function callback"
  (end-of-line)
  (funcall fun)
  (evil-append nil)
  )
**** key bindings
(evil-define-key 'normal org-mode-map
  "K" 'outline-previous-visible-heading
  "L" (if (fboundp 'org-forward-same-level) ;to be backward compatible with older org version
	   'org-forward-same-level
	  'org-forward-heading-same-level)
  "H" (if (fboundp 'org-backward-same-level)
	   'org-backward-same-level
	  'org-backward-heading-same-level)
  "J" 'outline-next-visible-heading
  "k" 'previous-line
  "j" 'next-line
  "m" 'set-mark-command
  "q" 'fill-paragraph
  "o" '(lambda () (interactive) (evil-org-eol-call 'clever-insert-item))
  "O" '(lambda () (interactive) (evil-org-eol-call 'org-insert-heading))
  "$" 'org-end-of-line
  "^" 'org-beginning-of-line
  "<" 'org-metaleft
  ">" 'org-metaright
  "[" 'backward-sentence
  "]" 'forward-sentence
  "{" 'org-backward-paragraph
  "}" 'org-forward-paragraph
  "-" 'org-cycle-list-bullet
  (kbd "<tab>") 'org-cycle)
*** ESC quits almost anything
#+BEGIN_SRC emacs-lisp
   (define-key evil-normal-state-map [escape] 'keyboard-quit)
   (define-key evil-visual-state-map [escape] 'keyboard-quit)
   (define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
   (define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
   (define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
   (define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
   (define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
#+END_SRC
*** Change color of evil cursor
#+BEGIN_SRC emacs-lisp
(setq evil-mode-line-format nil
         evil-insert-state-cursor '(bar "#dc322f")
         evil-normal-state-cursor '(box "#268bd2")
         evil-visual-state-cursor '(box "#d33682"))
#+END_SRC 
*** Improve EVIL behavior with visual lines
#+BEGIN_SRC emacs-lisp
;; Make movement keys work like they should
(define-key evil-normal-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-normal-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-next-line>") 'evil-next-visual-line)
(define-key evil-motion-state-map (kbd "<remap> <evil-previous-line>") 'evil-previous-visual-line)
; Make horizontal movement cross lines                                    
(setq-default evil-cross-lines t)
#+END_SRC
*** quickly switch buffers
#+BEGIN_SRC emacs-lisp
(define-key evil-normal-state-map (kbd "C-j") 'next-buffer)
(define-key evil-normal-state-map (kbd "C-k") 'previous-buffer)
(define-key evil-normal-state-map (kbd "C-S-h") 'evil-window-left)
(define-key evil-normal-state-map (kbd "C-S-j") 'evil-window-down)
(define-key evil-normal-state-map (kbd "C-S-k") 'evil-window-up)
(define-key evil-normal-state-map (kbd "C-S-l") 'evil-window-right)

;; make navigation easy
(setq frame-title-format "%b")
#+END_SRC 
*** turn off auto-indent 
(setq evil-auto-indent nil)
*** EVIL multiple cursors
#+BEGIN_SRC emacs-lisp
(require 'evil-mc)
(global-evil-mc-mode  1)
(define-key evil-mc-key-map (kbd "C->") 'evil-mc-make-and-goto-next-match)
(define-key evil-mc-key-map (kbd "M->") 'evil-mc-make-and-goto-next-cursor)
(define-key evil-mc-key-map (kbd "C-<") 'evil-mc-make-and-goto-prev-match)
(define-key evil-mc-key-map (kbd "M-<") 'evil-mc-make-and-goto-prev-cursor)
#+END_SRC 
** Projectile
#+BEGIN_SRC emacs-lisp
;; enable projectile by default
(projectile-global-mode)

;; replace annoying EMACS cursor commands
(global-set-key (kbd "C-p") nil) 

;; add a more nemonic command
 (setq projectile-keymap-prefix (kbd "C-p"))
 (require 'projectile)
#+END_SRC
** Swiper - Ivy - Counsel
*** basic config
#+BEGIN_SRC emacs-lisp
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq ivy-count-format "(%d/%d) ") 
#+END_SRC
