.emacs.d/emacs_settings.el

(global-set-key (kbd "C-s") 'swiper)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "M-y") 'counsel-yank-pop)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> l") 'counsel-load-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)

(setq projectile-completion-system 'ivy)

;; specify agenda files
(setq org-agenda-files (list "~/Dropbox/org/todo.org"))

;; necessary function 1
(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.
PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
        (pri-value (* 1000 (- org-lowest-priority priority)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
        subtree-end
      nil)))

;; necessary function 2
(defun air-org-skip-subtree-if-habit ()
  "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
  (let ((subtree-end (save-excursion (org-end-of-subtree t))))
    (if (string= (org-entry-get nil "STYLE") "habit")
        subtree-end
      nil)))

;; build composite agenda view
(setq org-agenda-custom-commands
 '(("x" agenda)
    ("n" todo "不")
    ("N" todo-tree "不")
    ("w" todo "等")
    ("W" "Weekly Review"
         ((tags "PRIORITY=\"A\""
           ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("完" "答" "取")))
            (org-agenda-overriding-header "Tâches prioritaires:")))
          (agenda "" ((org-agenda-ndays 7)))
          (alltodo ""
           ((org-agenda-skip-function '(or (org-agenda-skip-entry-if 'nottodo '("行"))
                                                             (air-org-skip-subtree-if-habit)
                                                             (air-org-skip-subtree-if-priority ?A)
                                                             (org-agenda-skip-if nil '(scheduled deadline))))
                                                             (org-agenda-overriding-header "Tâches en cours:")))
          (alltodo ""
           ((org-agenda-skip-function '(or (org-agenda-skip-entry-if 'nottodo '("不"))
                                                             (air-org-skip-subtree-if-habit)
                                                             (air-org-skip-subtree-if-priority ?A)
                                                             (org-agenda-skip-if nil '(scheduled deadline))))
                                                             (org-agenda-overriding-header "Tâches urgentes:")))
          (alltodo ""
           ((org-agenda-skip-function '(or (org-agenda-skip-entry-if 'nottodo '("等"))
                                                             (air-org-skip-subtree-if-habit)
                                                             (air-org-skip-subtree-if-priority ?A)
                                                             (org-agenda-skip-if nil '(scheduled deadline))))
                                                             (org-agenda-overriding-header "Tâches en attente:"))))
          ((org-agenda-compact-blocks t)))))

(setq org-startup-indented t)

(setq org-startup-truncated nil)

;; (setq org-startup-folded nil)

;; (add-hook 'org-mode-hook 'turn-on-visual-line-mode)
(add-hook 'org-mode-hook 'turn-on-auto-fill)

;; (setq org-hide-emphasis-markers t)

(setq org-todo-keywords 
          '((sequence "不(t)" "行(p)" "完(d)")
            (sequence "等(w)" "|" "取(c)")
            (sequence "疑(q)" "|" "答(a)")))

;; set faces for org-todo-keywords
(setq org-todo-keyword-faces
      '(("不" . (:foreground "#dc322f" :weight bold))
        ("完" . (:foreground "#859900" :weight bold))   
        ("疑" . (:foreground "#d33682" :weight bold))
        ("答" . (:foreground "#268bd2" :weight bold)) 
        ("等" . (:foreground "#cb4b16" :weight bold))
        ("取" . (:foreground "#6c71c4" :weight bold)) 
        ("行" . (:foreground "#b58900" :weight bold)) 
        ))

(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("一" "二" "三" "四" "五" "六" "七" "八" "七" "九" "十"))

;; (add-hook 'org-mode-hook 'flyspell-mode)
;; (add-hook 'org-mode-hook 'flyspell-buffer)
